Naming category id of the second assembly
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public ElementId NamingCategoryId2 { get; }
  Visual Basic
Public ReadOnly Property NamingCategoryId2 As ElementId
	Get
  Visual C++
public:
property ElementId^ NamingCategoryId2 {
	ElementId^ get ();
}
 See Also
  AssemblyDifferenceNamingCategory Class
  Autodesk.Revit.DB Namespace